Revit 2027 API
BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled Property
 Identifies if any radial or diameter dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BendDiameterDimensionsEnabled { get; set; }
Public Property BendDiameterDimensionsEnabled As Boolean
	Get
	Set
public:
property bool BendDiameterDimensionsEnabled {
	bool get ();
	void set (bool value);
}
member BendDiameterDimensionsEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace